"Service Update Failed" = "העדכון נכשל";
"Service Update Complete" = "העדכון הסתיים";
"Starting Service Update" = "מפעיל את עדכון השירות";
"Dismiss" = "דחה";
"OK" = "אישור";
"Call disallowed" = "מספר זה אינו מותר";
